#Вывод Да если число четырехзначное, НЕТ в противном случае

# number = int(input("Введите целое число: "))
# if 999 < number < 10000 or -999 > number > -10000:
#     print("YES")
# else:
#     print("NO")

#Описание введеного числа(четность, +/-, 0)
# number = int(input("Введите целое число: "))
# if number % 2 == 0 and number > 0:
#     print("Положительное четное число")
# elif number % 2 != 0 and number > 0:
#     print("Положительное нечетное число")
# elif number % 2 == 0 and number < 0:
#     print("Отрицательное четное число")
# elif number % 2 != 0 and number < 0:
#     print("Отрицательное нечетное число")

#Задача с машиной
# n = int(input('Введите скорость машины (км/день):'))
# m = int(input('Введите длину маршрута (км):'))
# m = -m
# result = -(m // n)
# print(f'Машине потребуется {result} дня(-ей) для преодоления маршрута длиной {-m} км')

